Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 其余人也醒悟过来，跟着弯身行礼道：“参见武堂长老。”
en_us: Everyone awoke from the realization and followed up with a respectful bow, "Greetings Martial Court Elder."

source: 其余人江逸不管，这江麒麟可是认出了他。以江麒麟的本事，他进了学院很快就会找来吧？那可是神武国第二世家的公子啊！姬听雨让他低调些，没想到还没进学院就已经得罪了一个大人物。
en_us: Jiang Yi did not care about the rest, but Jiang Qilin did recognize him. With Jiang Qilin's ability, is it even a question that he will come for me quickly after entering collage? He is the Young Master of number two clan in the Divine Martial Kingdom! Ji Tingyu reminded him to stay low-key, yet he never expected to offend an important figure before even entering collage.

source: 其余四位堂主神情一紧，也退开了一步，纷纷在周身亮起了一圈金色的防御结界，奚秋一边结印还一边解释，“鬼王的声音，直接攻击元神，此声非同小可！”
en_us: The rest of the four hall masters' expressions tensed up and they stepped back. One after another, they lit up the golden defensive barrier surrounding them. Xi Qiu explained while he removed the seal, "The Ghost King's sound attack targets the primordial spirit directly. It is not to be belittled!"

source: 其余的冥将也不敢多言，纷纷发出最强大的神通，督促手下的尸兵尸兽阴兵等全力开始进攻。
en_us: The other Netherworld generals did not dare utter another word. They pumped themselves up and ordered their subordinate zombie soldiers, zombie-beasts, and yin soldiers to begin attacking at full force.

source: 其它两人也立马看了过去，脸色顿时就变了。
en_us: The other two immediately looked in Lonemoon's direction, their expressions changing at what they saw.

source: 其它两人细一感应，也是一惊，“果然是魔修的阴气，难道有魔修趁机闯入？不知这次进来的到底是何人？”
en_us: The other two tried to sense it and were also shocked. "It is indeed the Yin Qi of a fiendish cultivator, could a fiendish cultivator have broken in here? Who exactly is the person that is coming in this time?"

source: 其它妖王也纷纷站起来响应，就连四周待命各族各妖们，也纷纷现形的现形，亮爪的亮爪，激动的大喊起了报仇的口号，嫣然一副整军待发的样子。一时间各种妖吼狼嚎，响彻云霄，久久不息，直到……
en_us: The other Demon Monarchs stood up in support, and even the demons gathered in the area returned to their true forms. They bared their claws as they cried out for revenge. They were the very picture of an army that was prepared to march to war. All sorts of roarings from the demons swept through the area and reverberated through the clouds endlessly until…

source: 其它弟子也纷纷围了上来。
en_us: The other disciples also gathered around Shen Ying.

source: 其实从出发来悟剑峰开始，她就没打算再活着回去。剑修羿清先不说，孤月更是玄天宗的化神尊者，他们没理由放过她！只是……没机会再还沈萤人情了。
en_us: In fact, ever since she set off for Sword Comprehension Peak, she had no plans on returning alive. The sword cultivator, Yi Qing, had said that Lonemoon was a Soul Formation Supremacy of Blackheaven Sect. There was no reason for them to let her off! It was just that… she had no means to repay her debt to Shen Ying.

source: 其实他也没想过会这么快，从那场顿悟开始，他就发现自己的修为一直在缓慢的上涨。之前白泽那朵玄灵花，也放在他这有一段时间，那种特殊的灵气，好似也对修为有益。他才在这几天终于达到了大圆满境界。
en_us: In fact, he had not thought that it would be so fast. Ever since his epiphany, he found that his cultivation had been slowly rising. Bai Ze's Black Spirit Blossom had been placed near him for a while and its special aura seemed to have been beneficial to his cultivation, resulting in him finally attaining the Perfected State.

source: 其实在场的三家都知道，这郁家的目的，根本不是为了抓什么逃奴。只是无敌派突然出现，而且实力强悍，郁家跟其它世家一样动了心思而已。
en_us: Actually all three families present knew the motive of the Yu Family was not to capture some escaped slave. It was just that the sudden entrance of Invincible Sect whom had such formidable capabilities caused the families to devise some plans.

source: 内视了一阵，江逸生怕元力丹的药力挥散过多，连忙不敢多看，让黑色元力融合绿色药力包裹整个丹田，然后收回心神，一心一意的运转江水决提炼元力。
en_us: Observing for a moment, Jiang Yi started feeling worried that the medical power of the essence force pill was overly disseminated. He anxiously decided to stop observing any further, and instead allow his black essence force to merge with the green medical power and envelope his entire dantian. Subsequently, he focused his mind, putting all his thoughts and attention towards circulating the Jiang Water Art to refine more essence force.

source: 内视到丹田外被淡淡的绿色药力环绕，江逸收回思绪，运转一缕黑色元力出了丹田，通过经脉朝丹田之外的绿色药力流转而去。
en_us: Observing a faint green light revolving around his dantian, Jiang Yi cut off his stream of thoughts. He circulated a thread of black essence force out of his dantian and transferred it through his meridians out to the exterior of the dantian in the direction of the green medical power.

source: 再三保证三月内绝对回来，江逸告别了荣管事，从江家南院快速出门，一走出江家大门他立即带上了斗篷，快步朝武殿内走去。
en_us: Jiang Yi bid Chief Rong farewell after repeated promises to return in three months' time. He swiftly exited the Jiang Clan from the north gates and wrapped himself up with a cloak the moment he was out the door, striding briskly towards the Martial Arts Hall

source: 再加上三大世家家主从塔内逃出后，纷纷宣布与郁家决裂，并道出了塔内的真相。那根本不是什么升仙塔，而是专门吸食人肉体，修为，乃至元神的魔塔。若不是无敌派羿清尊者，拼死相救破塔而出，强行唤醒了塔中的众人。整个上青界的化神修士，怕都要折在这塔中。
en_us: After the remaining three arisoticratic family family masters escaped from the pagoda, they announced that they would cut ties with the Yu Family. They also told everybody the truth behind the pagoda. It was not an Immortal Ascension Pagoda - it was a fiendish pagoda that specialised in sucking the power, cultivaion and primodial spirit of all the cultivators. If it had not been for Invincible Sect's Supremacy Yi Qing, who fought to break the pagoda with all his might, all the Soul Formation cultivators in the Upper Azure World would still be trapped in the pagoda.

source: 再想试，才注意到体内已经没剩有黑色元力了——辛辛苦苦修炼了两个时辰才积攒的六丝黑色元力，已经被他在半柱香的时间里挥霍完了。
en_us: He wanted to try again but realized that he no longer had any black essence force within his body. The six slivers of black essence force that he painstakingly took four hours to cultivate were gone in minutes.

source: 再次摸了摸小奴的脑袋，江逸起身道：“行了，我先和荣管事去说一声，小奴，等我回来。”
en_us: With another stroke of Xiaonu's head, Jiang Yi got up and said, "All right, I'll go inform Chief Rong. Xiaonu, wait for my return."

source: 再次看了一眼两半的海岛，现在还分开着的海水，和玄天宗那被劈成两半的浮峰……
en_us: Lonemoon looked once again at the two halves of the island, at the sea that was still parted, and at Blackheaven Sect's mountain peak that had been split in two.

source: 再次过了小半个柱香时间，翊飞儿气鼓鼓的朝大门外走去，打开大门快速消失在走廊内。
en_us: After several minutes, Yi Fei-er petulantly headed towards the doors and disappeared swiftly down the hallway.

source: 再看那朵玄灵花，顿时觉得四周灵气都猥锁了起来。
en_us: They glanced at the Black Spirit Blossom and suddenly began to feel the Spirit Qi around them go still.

source: 再翻看了五六本书册之后，他终于找到一本炼丹术简录，翻看了几页找到了丹药回炉的方法。
en_us: After scanning through five or six manuals, he finally found a simplified manual on the alchemy-refining process. Flipping through a few pages in the book, he found the correct method for the elixir reheating process.

source: 再说凭什么让他去啊？大敌当前，沈萤那个当掌门都在睡觉，他一个来讨债的却要来帮忙，这是什么道理。这个任务他拒绝接受！拒绝！说什么都得把人给叫起来。
en_us: Who was he to attempt to defend the sect by himself anyway? Shen Ying, the Sect Master, was sleeping while enemies attempted to invade her sect. He was here to take revenge, yet he was expected to defend her sect on her behalf? What kind of logic was that? He refused to take on this mission! Refused! He had to wake Shen Ying up no matter what.

source: 再说身为上仙门的玄天宗，怎么可能不管这种事，只是未曾发觉而已。
en_us: As a sect with an exalted immortal, it was impossible for the Blackheaven Sect to ignore such matters; it was only because it had yet to discover those deeds.

source: 冥皇冷冷道：“如今四皇大军远在天边，而且各怀鬼胎，百万天庭神兵神将也随着这场战争的继续，军心涣散，死的死，散的散。”
en_us: "The four imperial troops are now deployed in remote places. Besides, each of them has their own evil schemes. Millions of Heavenly Court troops will perish, scatter, or lose their morale because of this long war."

source: 冥皇冷然训斥了一句，那红眸在四周将领身上一扫，看得他们浑身一颤，才冷幽幽的说道：“九天锁星阵不过是九阳老儿花了三千年研究，再花两千年才布置出来的新阵。成阵距今也就一千六百年。它再能吸纳，又能吸纳多少星辰能量转化为护阵法力？本座给你们十二个时辰，此刻天庭内外只剩下九阳老儿一个人，一天之内无视伤亡，不计数量，不惜代价，给本座攻破此阵！”
en_us: The Netherworld King then swept his cold, red-eyed eyes across the surrounding generals. Upon seeing them tremble, he uttered coldly, "The Empyreal Star Lock Array is just an array which took Fogey Nine-Yang three thousand years to research. “He spent another two thousand years setting it up. Ever since it was successfully set up, it has only been 1600 years. How much energy can it absorb from the stars to turn them into an array formation forcefield? Now that Fogey Nine-Yang is the only one left inside the Heavenly Court, you will be given twenty-four hours to destroy this array formation regardless of the cost or number of casualties we suffer!"

source: 冥皇手中的镰刀微微一动，但还是没有出手，因为他明白无名垂死一击的意念已经锁死了自己，倘若自己想要出手拦下那些碎片的话，无名的亡命攻击会让他付出足够惨痛的代价。
en_us: The sickle in the Netherworld King's hands jolted a little, but he chose not to attack. This was because he knew Wu Ming's dying intention had shackled him. If he took action to shield off the numerous shards, Wu Ming's final attack would make him pay a tragic price.

source: 冥皇没有理会部下的狂热，只将目光凝视着下方这座宏伟的巨城，暗红的眸子内闪过一丝火热的亮意。
en_us: The Netherworld King ignored his fanatical subjects. Instead, his vision was fixed on the grand city in front, his dark red eyes burning bright.

source: 冥皇没有看这冥将一眼，只是一声冷哼，那冥将的身子立即了飞出去，身上血肉甚至黑甲尽数化为飞灰。
en_us: Not batting an eye at the Netherworld general, the Netherworld King gave a cold snort. The Netherworld general immediately flew into the air as his flesh and blood, as well as his black armor, disintegrated into flying ash.

source: 冥皇身边一名全身笼罩在华丽黑甲中的冥将发出一声无奈的叹声，随即朝冥皇拱手禀道：“陛下，这九天锁星阵平素吸收九天星辰散发出来的能量，沉淀在天庭中的每一处角落，其容纳力据说没有上限。只怕是在这些长年累月积攒下来的能量消耗殆尽前，我军很难攻入其中。”
en_us: A Netherworld warrior with ornate armor let out an exasperated sigh. He turned to the Netherworld King next to him and said, "Your Majesty, this Empyreal Star Lock Array absorbs the energy from the Ninth Heaven Star, scattering it throughout every corner of the Heavenly Court. Its capacity is limitless. I am afraid our army is unable to penetrate the barrier before the energy which has accumulated for eons wears off."

source: 冥皇那头灰色的长发无风自动，阴鸷的眸子内红光时明时暗，无不显露出他此刻内心再也压抑不住的的情绪。蓦然，从冥皇的身体内腾起无尽的杀气，随后他将手缓缓抬起，食指指向天庭。
en_us: The Netherworld King's long grey hair fluttered despite the lack of wind. Red light flickered in his lifeless eyes, unable to conceal the brimming emotions that were running through his heart. Suddenly, boundless killing intent arose from the Netherworld King's body. Following which, he slowly lifted his hands and pointed at the Heavenly Court with his index finger.

source: 冥皇，不，现在应该称之为冥帝的存在，在没好气地留下一句话后，撕裂虚空，转身离开了天界。
en_us: The Netherworld King—no, he was now an existence worthy of the name Netherworld Emperor, delivered those words in a peeved manner. He then tore open the void and turned to leave the Heavenly Realm.

source: 决赛采用的是两两对决，胜者进入下一轮，再以抽签的方式决定一人轮空，再决出前三名。孤月昨晚就已经跟进入决赛的四人说过了，进入十强的小目标已经达到，不必太过拼命，特别是金丹的两人。十强中其它门人可全都是金丹大满圆的世家弟子。
en_us: The finals were to be conducted in pairs. The winners would proceed to the next round and draw lots to decide who would be given a walkover. The top three would be selected from this process. Lonemoon had already briefed the four disciples who made it to the finals the night before. They had already achieved their mini goal: to make it to the top ten. He told them that there was no need to fight to their death, especially for those who were still at the Golden Core stage. After all, their competitors were all disciples from the aristocratic families who had already achieved the Perfected Golden Core stage.

source: 况且还留了众人一命，除了一开始打了他一顿，还尽打脸外。说来聊聊，还真就聊了聊。
en_us: What's more, she had let all of them live — although she did hit their master in the face. She said she came to have a chat and that was really all she did.

source: 况且这事明显就是轩辕家故意找茬，怎么可以怪到羿清一个人身上。他只是倒霉被那三人死前的影象捕捉到而已。
en_us: What's more, the Xuan Yuan Family was clearly stirring trouble. How could they blame everything on Yi Qing? He was just unlucky to have been captured by the three Elders' vision just before they had died.

source: 冷静！冷静！
en_us: Calm down! Calm down!

source: 净清殿内，阵法遍布，金色的阵法中间，正飘着一面黑色的幡旗，无风自动。大量的鬼气在上面涌动着，中心绘着一个残破的阵法，上面却没有一丝鬼气露出。
en_us: The array formation was spread throughout the Jing Qing Hall. In the middle of the golden array formation, a black flag fluttered in the windless air. A great mass of Ghost Qi was surging inside the flag. There was a broken formation in the center, but not a trace of Ghost Qi could be seen outside.

source: 几人一起走进了阵法之中。
en_us: The few of them walked into the array formation,

source: 几人几乎是用尽了全力，才终于制服了八个入魔的游仙。虽然羿清提议的方向，中途还是出了问题。孤月引走那些游仙一刻钟后。那些人似是察觉了什么问题一般，放弃了孤月转身又回去了。
en_us: They had almost exhausted all their energy before they finally managed to subdue the traveling immortals who were trapped in their trance. Despite following the plan Yi Qing had suggested, they had hit a snag along the way. Not long after Lonemoon had lured them away, the traveling immortals seemed to have discovered something amiss. They had abandoned their pursuit of Lonemoon and turned back.

source: 几人出来一看才知道，不止是坑内，连着方圆七八里的地面都在开裂，裂痕处一条条刺目的白光直冲天际，整个大地瞬间突出一块，地动山摇，有什么巨大的物体，正从地下升上来，而且越来越高。半会终于脱离了地面，升上了半空。
en_us: As they emerged from the pit, they realised that the cracks went on for a three to four kilometre radius. All the cracks had the same blinding white line shining through. A great piece of the land suddenly shot upwards as the ground continued to shake vigorously. A huge object seemed to be rising from underground. It was growing taller and taller. Soon, it fully emerged from underground and stood halfway to the sky.

source: 几人刚要走上法器，一晚上都在围着思羽妹子打转的印元飞，突然下意识的开口喊了一句，“思羽姑娘。”
en_us: The few of them were just about to walk to the Dharma artifact. Yin Yuanfei, who had been circling Sister Si Yu the entire night, suddenly exclaimed, "Miss Si Yu!"

source: 几人点了点头，也不知是有意还是无意的瞅向旁边的沈萤，眼神那叫一个闪亮。孤月也下意识的转头看了过去。
en_us: A few of them nodded as they glanced over at Shen Ying and their eyes lit up. Lonemoon subconsciously turned to look over at her as well.

source: 几人等了一会，见沈萤和萝卜半天没有挪动的意思，郁红不得不上前一步，试探的开口道，“仙师，仙师……掌门？”
en_us: Their little group waited for a while, but seeing that Shen Ying and radish did not seem like they were going to move, Yu Hong had no choice but to go ahead to sound her out. "Immortal Master, Immortal Master… Sect Master?"

source: 几人走进去一看，此时室内已经倒了好几个丹药架，地上滚落了好些瓶瓶罐罐。而半空之中青亦正抓着一个瓶子，笑得分外张狂。
en_us: Their small group walked in. A few shelves in the room had already fallen over. A few bottles were rolling around the floor. Qing Yi, who was in mid-air, was holding onto a bottle and laughing maniacally.

source: 凡人？
en_us: A mortal?

source: 凡是受玄天宗庇护的城镇，宗门都会在镇内布下防护阵法，以防身带煞气的，妖，兽，魔修进入祸害凡人。所以不先突破这层防护，根本没法进入镇里。当初接到这个镇的求助，说镇内有妖做乱，所以他下意识的就认为，这个防护阵早就已经被破了，所以谁都没想到去检查，却没想到它居然还在。
en_us: It was standard procedure for Blackheaven Sect to set up a defensive array formation in every town under their protection to prevent demons, beasts, and fiendish cultivators from entering and harming the town's mortals. So without breaking through this layer of defense, they had no way of entering the town at all. When Lonemoon first received the message for help from this town saying that there was a demon creating havoc, he had assumed that the defensive array formation had already been broken, so no one had thought of checking it. Yet, here it was.

source: 凡间的修士都是用灵气修练，无论什么剑术术法，都需要灵气支撑。他有仙气护体，灵气根本伤不到他分毫。但……体修是不用灵气，专靠拳头的啊！再加上刚刚他仙骨被踢断，用不了任何仙法，这会根本使不出任何法术，只能纯抗。
en_us: The cultivators in the mortal world all trained using the Spirit Qi. No matter what sword techniques they used, they needed Spirit Qi to sustain their training. He had Immortal Qi to proect his body, so Spirit Qi could not harm his body. But... body cultivators did not need Spirit Qi to train. They relied purely on their strength. What's more, his immortal bones had been broken and there was no immortal spell or technique he could use to defend himself against their attack.

source: 出……出来了！
en_us: It... came out!

source: 出乎江逸的意料之外，那荣管事很是大度的摆手道：“没事，这两天记得送过来就行，江逸你快去吧，省的柳长老等着。在炼丹房好好做事，千万记住别惹柳长老不高兴了！“
en_us: Beyond Jiang Yi's expectations, Chief Rong waved his hands with magnanimity and replied, "No problem. Just remember to send it over within the next two days. Jiang Yi, leave quickly and don't keep Elder Liu waiting. Do a good job at the alchemy lab, and remember to not make Elder Liu upset!"

source: 出于掌门的吩咐，思羽揍得很认真，简直拳拳到肉。足足打了半个时辰，才气喘咻咻的停了手，学着沈萤的样子，一脚踩在那张猪头一样的脸上，扬手拍了拍旁边的人。
en_us: Si Yu followed her Sect Master's instructions very strictly. She punched him continuously for half an hourbefore she finally stopped and stomped her leg down on his face as Shen Ying had done earlier. She nudged the person next to her.

source: 出门一趟好麻烦啊。
en_us: It's so troublesome to leave the house.

source: 刀下一空，叭的一下落在地上。
en_us: The knife struck nothing but air and it fell onto the ground with a clang.

source: 刘管事一张脸如死了亲爹般，等马飞伤势暂时压制了，立即拔腿就要往外跑，刚出门却听到一道冰冷到了极点的声音：“等等！”
en_us: Housekeeper Liu's expression was as grim as if his own father had expired. He waited until Ma Fei's injuries were under control before scrambling out the door. Yet just as he was stepping outside, an extremely cold voice was heard: "Wait!"

source: 刘管事一直退了七八步才站稳身子，看到江逸一拳带着无可抵挡之威朝马飞脑袋砸去被吓坏了，元力疯狂运转朝江逸再次爆射而去，大吼起来：“江家小儿，你敢伤我家公子，今日你必死无疑。”
en_us: Housekeeper Liu was forced seven or eight steps back before he could steady himself. Upon seeing Jiang Yi's fist, which carried an irresistible strength, about to hit Ma Fei in the head, he was scared out of his wits. Circulating his essence force in a frenzy, Housekeeper Liu shot towards Jiang Yi with a roar, "Brat Jiang, you would certainly die here today if you dare harm my Young Master!"

source: 刘管事却是知道江逸的厉害，那日他只是铸鼎境一重都把一名铸鼎境三重的护卫给伤了，虽然不知道江逸是怎么隐藏实力的，但他很谨慎的朝四周的护卫打了个眼色，身子朝马家公子靠近两步。
en_us: Housekeeper Liu however was aware of how strong Jiang Yi was. Jiang Yi, despite only having power level at first stage of the Cast Tripod Realm, was able to defeat a guard that day who was at the third stage of the Cast Tripod Realm. Although Housekeeper Liu did not know how Jiang Yi managed to conceal his true strength, he cautiously signaled with his eyes for the surrounding guards, while moving two steps closer to the Ma Family young master.

source: 刘管事和几名护卫惊恐的大叫起来，却只能眼睁睁的看着那把青色短剑没入了马飞的小腹内，然后所有人宛如听到一个皮球破裂漏气的声音……
en_us: Housekeeper Liu and several guards cried out frantically, but they were unable to do anything except watch the teal-colored short sword being plunged into Ma Fei's stomach. It was then that everyone heard a hissing noise, as if air was leaking from a ball...

source: 刘管事咬牙沉喝一声开始缓缓后退，其余护卫也脸色阴沉的不断退后，还好此刻姑娘们还在楼上，风月楼也没开张，否则一定会引起一片骚乱的。
en_us: Gritting his teeth, Housekeeper Liu issued the order and began moving back slowly. The other guards too shuffled backwards sullenly. It was fortunate that Fengyue Brothel had not yet opened for business and the ladies were still upstairs. Otherwise, it would have caused quite a commotion.

source: 刘管事沉喝一声，双手结了一个古怪的手印，双掌外突兀凝聚出一个五角星模样的元力护罩，他双掌朝前方连续拍出，将他前方的空间全部笼罩进去。
en_us: Housekeeper Liu shouted in a booming voice. He formed a strange hand-seal with his hands, both palms facing outwards and producing a pentagram-shaped essence force shield. He repeatedly shoved his palms forward, enshrouding the space in front of him with the force shield.

source: 刘管事沉声应道，心里却是松了一口气，这事既然马飞不想让家族知道，他们几人至少不会被家族重罚了。查江逸的资料？这虽然有些麻烦，但江家如此多下人，他们找人画出江逸和江小奴的画像，大把银子撒出去还是能打探到的。
en_us: Housekeeper Liu answered in the affirmative in a low voice, feeling relieved internally. Since Ma Fei preferred not to inform the family clan, that meant the lot of them would not be punished by the family clan. As for digging for information on Jiang Yi? Granted, it could be somewhat troublesome, but once they had the paintings of Jiang Yi and Jiang Xiaonu, and with so many servants in the Jiang Clan, they could still obtain the information if hey offered taels of silver pieces in exchange.

source: 刘管事浑身瘫软下来，身子一晃险些摔倒在地，他万万没想到这江家少年竟然如此狠，马飞这丹田一被废，这辈子注定是个废物，而他和在场所有护卫下场也绝不会太美妙！
en_us: All the strength had left Housekeeper Liu; his body swayed and almost dropped to the floor. He absolutely failed to consider how this youth of the Jiang Clan could be so ruthless. With his dantian ruined, Ma Fei was doomed to be useless for the rest of his life, and the fate awaiting for the rest of them would in no way be good!

source: 刘管事满眸的凶厉之光，盯着江逸爆吼起来：“江家小贼，立刻放了我家少爷，否则今日你必死无疑！”
en_us: Housekeeper Liu had a ferocious glint in his eyes. He roared at Jiang Yi, "Jiang Clan scoundrel, release my young master right now, or you would certainly die today!"

source: 刘管事的身体已经距离江逸两尺距离了，旁边两边护卫也即将击中江逸，但此刻所有人立刻顿住身子，还快速的后退一步。这马飞在马家地位尊荣，马飞一死，他们全部人都要死，他们自然不敢赌。
en_us: Housekeeper Liu was just two-third of a meter away from Jiang Yi, while the guards from both sides were similarly about to strike Jiang Yi. At that moment however, all of them stopped their movements at once and even hastily took a step back. Considering Ma Fei's high standing in the Ma Family, all of them would be sentenced to death if Ma Fei were to die here. Naturally, they could not afford to take that risk.

source: 刘管事立即屁颠屁颠的朝马家公子走去，附耳把那日的事情解释了一遍，最后还低声说道：“马飞少爷，那天我们的人也没怎么伤着，我想着是江家的人，我们这是做生意的就没大闹，也没上报家族……”
en_us: Housekeeper Liu went to the Ma Family young master promptly and eagerly, recounting the events occurred on that day in an undertone and ending his story with a deliberate remark: "Young Master Ma Fei, our men weren't hurt too badly that day, and since it was the Jiang Clan, we businessmen did not want to make a scene, so we did not report the incident to the family clan either... "

source: 刘管事被江逸一喝更慌了，连忙从怀中取出江逸给他的金叶子丢了过去，江逸单手快速抓住收入怀中，这才挟持着马飞一步步朝大门外走去，在大门口才一脚将马飞踹了进去，拿着马飞的宝器短剑大步朝远处狂奔而去。
en_us: Jiang Yi's pronouncement made Housekeeper Liu even more frantic. He hurriedly took out from the chest pocket the gold leaf Jiang Yi gave to him and threw it over. Jiang Yi caught it with one hand and swiftly put it away in his own chest pocket, before moving towards the gates step by step with Ma Fei in tow. When he went out of the gates, he kicked Ma Fei back in and bolted far away with Ma Fei's Treasured Artifact, the short sword, still in his possession.

source: 刘管事面色一僵，做生意的确讲究个信誉，他作为风月楼的管事，也算是有头有脸的人物，被传出去为难一个少年总是不好的。只是这位马飞少爷可是直系少爷，他父亲在马家权势极大，他也不敢冒然开口得罪，只能沉默。
en_us: Housekeeper Liu's expression turned rigid. Indeed, in doing businesses, credibility was of paramount importance. As the housekeeper of Fengyue Brothel, he was considered to be someone of reputable standing. It would do him no good if word got out that he had bullied a youth. However, Young Master Ma Fei was a direct bloodline descendant and his father held a great deal of power in the Ma Family, therefore making him someone Housekeeper Liu could not afford to offend. As it was, Housekeeper Liu could only remain silent.

source: 刘管事面色一变，慌忙护着那公子朝后面退去，那两名护卫也立即退后。其余方向的护卫则爆射而来，甚至还有两名护卫取出一把黑色匕首，准备给江逸放血了。
en_us: Housekeeper Liu's facial expression changed; he hastily shielded his young master and moved him backwards. The two guards too retreated at once, while guards from the other directions swarmed forth. There were even two of them who took out a black dagger, ready to shed Jiang Yi's blood.

source: 刘管事面色为难起来，摇头道：“公子，实在抱歉！小姐前天去了武殿修炼了。你要是有要紧的事，要不……我请示一下大总管？”
en_us: Housekeeper Liu's face betrayed a mixture of embarrassment and awkwardness. "My deepest apologies, Young Master!" he said, shaking his head. "Young Mistress left for the Martial Arts Hall on the day before yesterday. If you have an urgent matter to discuss, perhaps... I can speak with the chief supervisor?"

source: 刚一动封口，一道绿影瞬间就从袋里闪了出来。
en_us: Just as the seal on the bag was opened, something green suddenly emerged from it.

source: 刚出门的羿清却一脸纠结的回来了。
en_us: Yi Qing, who had just went out, came back looking conflicted.

source: 刚刚……发生了什么？
en_us: What... just happened?
